package org.example;

import org.example.repositories.CarRepository;

import java.sql.SQLException;
/*
В системі існує перелік Автомобілів, для якого необхідно реалізувати:
- вибір по марці;
- вибір по класу якості;
- сортування за вартістю прокату;
- сортування за назвою.
Клієнт реєструється в системі, обирає автомобіль та робить замовлення на оренду.
Незареєстрований клієнт не може зробити замовлення. В даних замовлення клієнт вказує
паспортні дані, опцію 'з водієм'/'без водія', термін оренди. Система формує Рахунок, який
клієнт оплачує.
Менеджер розглядає замовлення і може відхилити його, вказавши причину. Також менеджер
реєструє повернення автомобіля, у випадку пошкодження автомобіля виставляє через систему
рахунок на ремонт.
Адміністратор системи має права:
- додавання, видалення автомобілів, редагування інформації про автомобілі;
- блокування/розблокування користувачів;
- реєстрація менеджерів в системі.
 */
public class Main {

  public static void main(String[] args) throws SQLException {

  }
}